lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaTemperatureSensorJoinable/ZigbeeHaTemperatureSensorJoinable.ino
void applyBindingState() {
  if (!g_haveRestoredState || g_restoredState.bindingCount == 0U) {
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.bindingCount && i < 8U; ++i) {
    if (!g_restoredState.bindings[i].used) {
      continue;
    }
    (void)g_device.addBinding(g_restoredState.bindings[i].sourceEndpoint,
                              g_restoredState.bindings[i].clusterId,
                              g_restoredState.bindings[i].destinationAddressMode,
                              g_restoredState.bindings[i].destinationGroup,
                              g_restoredState.bindings[i].destinationIeee,
                              g_restoredState.bindings[i].destinationEndpoint);
  }
}

void sampleSensors() {
  int32_t tempMilliC = 0;
  if (g_temp.sampleMilliDegreesC(&tempMilliC, 400000UL)) {
    g_device.setTemperatureState(static_cast<int16_t>(tempMilliC / 10L), -4000,
                                 12500, 50U);
  }

  int32_t vbatMv = 0;
  uint8_t vbatPercent = 0;
  if (BoardControl::sampleBatteryMilliVolts(&vbatMv) &&
      BoardControl::sampleBatteryPercent(&vbatPercent)) {
    const uint8_t decivolts =
        static_cast<uint8_t>(vbatMv <= 0 ? 0 : (vbatMv / 100));
    const uint8_t halfPercent =
        static_cast<uint8_t>(vbatPercent >= 100U ? 200U : vbatPercent * 2U);
    g_device.setBatteryStatus(decivolts, halfPercent);
  }
}

static bool identifyIndicatorOn(uint32_t nowMs, uint8_t effectIdentifier) {
  switch (effectIdentifier) {
    case kZigbeeIdentifyEffectBlink:
    case kZigbeeIdentifyEffectOkay:
      return ((nowMs / 150U) & 0x01UL) == 0U;
    case kZigbeeIdentifyEffectBreathe:
      return ((nowMs % 1200U) < 800U);
    case kZigbeeIdentifyEffectChannelChange:
      return ((nowMs / 75U) & 0x01UL) == 0U;
    case kZigbeeIdentifyEffectFinishEffect:
      return true;
    default:
      return ((nowMs / 250U) & 0x01UL) == 0U;
  }
}

void applyJoinLed() {
  const uint32_t nowMs = millis();
  g_device.updateIdentify(nowMs);
  const bool ledOn =
      g_device.identifying()
          ? identifyIndicatorOn(nowMs, g_device.identifyEffect())
          : g_joined;
  Gpio::write(kPinUserLed, !ledOn);
}

void clearActiveNetworkKey() {
  memset(g_activeNetworkKey, 0, sizeof(g_activeNetworkKey));
  g_activeNetworkKeySequence = 0U;
  g_haveActiveNetworkKey = false;
}

void configureDeviceForCurrentNetwork() {
  ZigbeeBasicClusterConfig basic{};
  basic.manufacturerName = NRF54L15_CLEAN_ZIGBEE_BASIC_MANUFACTURER_NAME;
  basic.modelIdentifier = NRF54L15_CLEAN_ZIGBEE_BASIC_MODEL_IDENTIFIER;
  basic.swBuildId = NRF54L15_CLEAN_ZIGBEE_BASIC_SW_BUILD_ID;
  basic.powerSource = 0x03U;
  g_device.configureTemperatureSensor(kLocalEndpoint, kIeeeAddress, g_localShort,
                                      g_panId, basic, 0x0000U);
  applyReportingState();
  applyBindingState();
  sampleSensors();
}

bool persistState() {
  refreshCommissioningState();
  ZigbeePersistentState state{};
  ZigbeeCommissioning::populatePersistentState(
      g_network, kIeeeAddress, ZigbeeLogicalType::kEndDevice,
      g_device.config().manufacturerCode, &state);

  const ZigbeeReportingConfiguration* reporting = g_device.reportingConfigurations();
  uint8_t copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!reporting[i].used) {
      continue;
    }
    state.reporting[copied++] = reporting[i];
  }
  state.reportingCount = copied;
  const ZigbeeBindingEntry* bindings = g_device.bindings();
  copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!bindings[i].used) {
      continue;
    }
    state.bindings[copied++] = bindings[i];
  }
  state.bindingCount = copied;
  return g_store.save(state);
}

void restoreState() {
  memset(&g_restoredState, 0, sizeof(g_restoredState));
  g_haveRestoredState = false;
  ZigbeeCommissioning::initializeEndDeviceState(&g_network,
                                                commissioningPolicy(),
                                                kPreferredChannel,
                                                kPreferredPanId, kTempShort,
                                                kCoordinatorShort);

  ZigbeePersistentState state{};
  if (g_store.load(&state) && state.ieeeAddress == kIeeeAddress) {
    g_restoredState = state;
    g_haveRestoredState = true;
    ZigbeeCommissioning::restoreEndDeviceState(&g_network, state, kIeeeAddress);
  }
  if (!g_joined && !g_rejoinPending) {
    ZigbeeCommissioning::requestNetworkSteering(&g_network);
  }

  configureDeviceForCurrentNetwork();
  applyJoinLed();
}

void clearJoinState(bool clearStore) {
  refreshCommissioningState();
  ZigbeeCommissioning::clearEndDeviceState(&g_network, clearStore);
  clearPendingApsAck();
  clearRecentInboundAps();
  if (clearStore) {
    memset(&g_restoredState, 0, sizeof(g_restoredState));
    g_haveRestoredState = false;
  }
  configureDeviceForCurrentNetwork();
  applyJoinLed();
  if (clearStore) {
    g_store.clear();
  } else {
    persistState();
  }
}

ZigbeeCommissioningStartRequest requestCommissioningStart() {
  refreshCommissioningState();
  return ZigbeeCommissioning::requestRejoinOrSteering(&g_network);
}

void handleAcceptedLeaveRequest(uint8_t leaveFlags) {
  const ZigbeeAcceptedLeaveDisposition disposition =
      ZigbeeCommissioning::applyAcceptedLeaveRequest(&g_network, leaveFlags);

  if (disposition == ZigbeeAcceptedLeaveDisposition::kClearState) {
    Serial.print("mgmt_leave accepted clear\r\n");
    clearJoinState(true);
    return;
  }

  clearPendingApsAck();
  clearRecentInboundAps();
  if (disposition == ZigbeeAcceptedLeaveDisposition::kPersistRejoin) {
    persistState();
    Serial.print("mgmt_leave accepted rejoin\r\n");
    return;
  }

  Serial.print("mgmt_leave accepted rejoin_unavailable failure=");
  Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
  Serial.print("\r\n");
  clearJoinState(true);
}

void clearPendingApsAck() {
  memset(g_pendingApsAcks, 0, sizeof(g_pendingApsAcks));
}

