lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaTemperatureSensorJoinable/ZigbeeHaTemperatureSensorJoinable.ino
void clearPendingApsAckSlot(uint8_t slot) {
  if (slot >= kPendingApsAckSlots) {
    return;
  }
  memset(&g_pendingApsAcks[slot], 0, sizeof(g_pendingApsAcks[slot]));
}

void clearRecentInboundAps() {
  memset(&g_recentInboundAps, 0, sizeof(g_recentInboundAps));
}

bool hasPendingApsAcks() {
  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    if (g_pendingApsAcks[i].active) {
      return true;
    }
  }
  return false;
}

bool matchesPendingApsAck(const PendingApsAck& pending,
                          const ZigbeeApsAcknowledgementFrame& ack,
                          uint16_t sourceShort) {
  return pending.active && ack.valid && !ack.ackFormatCommand &&
         sourceShort == pending.destinationShort &&
         ack.counter == pending.counter &&
         ack.clusterId == pending.clusterId &&
         ack.profileId == pending.profileId &&
         ack.destinationEndpoint == pending.sourceEndpoint &&
         ack.sourceEndpoint == pending.destinationEndpoint;
}

bool findPendingApsAckSlot(const ZigbeeApsAcknowledgementFrame& ack,
                           uint16_t sourceShort, uint8_t* outSlot) {
  if (outSlot == nullptr) {
    return false;
  }

  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    if (matchesPendingApsAck(g_pendingApsAcks[i], ack, sourceShort)) {
      *outSlot = i;
      return true;
    }
  }
  return false;
}

void rememberPendingApsAck(uint16_t destinationShort,
                           const ZigbeeApsDataFrame& aps,
                           const uint8_t* payload, uint8_t payloadLength) {
  uint8_t slot = kPendingApsAckSlots;
  if (aps.deliveryMode != kZigbeeApsDeliveryUnicast || !aps.ackRequested ||
      payloadLength > sizeof(g_pendingApsAcks[0].payload) ||
      (payloadLength > 0U && payload == nullptr)) {
    return;
  }
  const uint32_t nowMs = millis();
  uint8_t oldestActiveSlot = 0U;
  bool haveOldestActiveSlot = false;
  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    PendingApsAck& pending = g_pendingApsAcks[i];
    if (pending.active &&
        pending.destinationShort == destinationShort &&
        pending.counter == aps.counter &&
        pending.clusterId == aps.clusterId &&
        pending.profileId == aps.profileId &&
        pending.destinationEndpoint == aps.destinationEndpoint &&
        pending.sourceEndpoint == aps.sourceEndpoint) {
      slot = i;
      break;
    }
    if (!pending.active ||
        static_cast<int32_t>(nowMs - pending.deadlineMs) >= 0) {
      slot = i;
      break;
    }
    if (!haveOldestActiveSlot ||
        static_cast<int32_t>(pending.deadlineMs -
                             g_pendingApsAcks[oldestActiveSlot].deadlineMs) < 0) {
      oldestActiveSlot = i;
      haveOldestActiveSlot = true;
    }
  }
  if (slot >= kPendingApsAckSlots) {
    slot = oldestActiveSlot;
  }

  PendingApsAck& pending = g_pendingApsAcks[slot];
  memset(&pending, 0, sizeof(pending));
  pending.active = true;
  pending.destinationShort = destinationShort;
  pending.counter = aps.counter;
  pending.clusterId = aps.clusterId;
  pending.profileId = aps.profileId;
  pending.destinationEndpoint = aps.destinationEndpoint;
  pending.sourceEndpoint = aps.sourceEndpoint;
  pending.retriesRemaining = kApsAckRetryLimit;
  pending.payloadLength = payloadLength;
  if (payloadLength > 0U) {
    memcpy(pending.payload, payload, payloadLength);
  }
  pending.deadlineMs = nowMs + kApsAckTimeoutMs;
}

void rememberRecentInboundAps(uint16_t sourceShort,
                              const ZigbeeApsDataFrame& aps) {
  g_recentInboundAps.valid = true;
  g_recentInboundAps.sourceShort = sourceShort;
  g_recentInboundAps.counter = aps.counter;
  g_recentInboundAps.clusterId = aps.clusterId;
  g_recentInboundAps.profileId = aps.profileId;
  g_recentInboundAps.destinationEndpoint = aps.destinationEndpoint;
  g_recentInboundAps.sourceEndpoint = aps.sourceEndpoint;
  g_recentInboundAps.deliveryMode = aps.deliveryMode;
  g_recentInboundAps.expiresMs = millis() + kRecentInboundApsWindowMs;
}

bool isRecentInboundApsDuplicate(uint16_t sourceShort,
                                 const ZigbeeApsDataFrame& aps,
                                 uint32_t nowMs) {
  if (!g_recentInboundAps.valid ||
      static_cast<int32_t>(nowMs - g_recentInboundAps.expiresMs) >= 0) {
    clearRecentInboundAps();
    return false;
  }
  return g_recentInboundAps.sourceShort == sourceShort &&
         g_recentInboundAps.counter == aps.counter &&
         g_recentInboundAps.clusterId == aps.clusterId &&
         g_recentInboundAps.profileId == aps.profileId &&
         g_recentInboundAps.destinationEndpoint == aps.destinationEndpoint &&
         g_recentInboundAps.sourceEndpoint == aps.sourceEndpoint &&
         g_recentInboundAps.deliveryMode == aps.deliveryMode;
}

bool sendNwkCommand(uint16_t destinationShort, const uint8_t* payload,
                    uint8_t payloadLength) {
  if (!g_joined || payload == nullptr || payloadLength == 0U) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kCommand;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              payload, payloadLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, payload, payloadLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

  return g_radio.transmit(psdu, psduLength, false, 1200000UL);
}

bool sendApsFrameExtendedWithCounter(
    uint16_t destinationShort, uint8_t deliveryMode,
    uint16_t destinationGroup, uint8_t destinationEndpoint,
    uint16_t clusterId, uint16_t profileId, uint8_t sourceEndpoint,
    const uint8_t* payload, uint8_t payloadLength, uint8_t apsCounterValue,
    bool trackAck) {
  if (!g_joined) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

